chinawrj/esp32-display-qemu-demo/examples/wifi_sta/sdkconfig.defaults
# Example defaults for QEMU Wi-Fi station test
# Enables the QEMU virtual Wi-Fi driver, disables AP mode

CONFIG_ESP_WIFI_SOFTAP_SUPPORT=n
CONFIG_ESP_WIFI_QEMU=y

# Set to your SSID and password (or override via menuconfig)
CONFIG_ESP_WIFI_SSID="QEMU_TEST"
CONFIG_ESP_WIFI_PASSWORD=""
CONFIG_ESP_MAXIMUM_RETRY=5

# Target
CONFIG_IDF_TARGET="esp32"
